In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('Winter-Intern-Challenge-DataSet.csv')

In [2]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', None)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   object
dtypes: int64(5), object(2)
memory usage: 234.4+ KB

In [4]:
df['created_at'] = pd.to_datetime(df['created_at'], errors='coerce')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 254.0+ KB

In [6]:
df.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [7]:
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 04:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 04:35:11

In [8]:
#filter required columns
shopify_data= df[['shop_id', 'order_amount', 'total_items', 'created_at']]

In [9]:
shopify_data_group=shopify_data.groupby('shop_id').agg({
                                        'order_amount': lambda quant: quant.sum(),
                                        'total_items': lambda quant: quant.sum()})
shopify_data_group.head()

         order_amount  total_items
shop_id
1               13588           86
2                9588          102
3               14652           99
4               13184          103
5               13064           92

In [10]:
# Average Order Value
shopify_data_group['avg_order_value']=shopify_data_group['order_amount']/shopify_data_group['total_items']
shopify_data_group.head()

         order_amount  total_items  avg_order_value
shop_id
1               13588           86            158.0
2                9588          102             94.0
3               14652           99            148.0
4               13184          103            128.0
5               13064           92            142.0

In [11]:
Total_order_amount = shopify_data_group['order_amount'].sum()
Total_order_amount

15725640

In [12]:
SubTotal_items= shopify_data_group['total_items'].sum()
SubTotal_items

43936

In [13]:
Average_order_value= Total_order_amount/ SubTotal_items
Average_order_value

357.92152221412965

In [14]:
x= shopify_data_group.drop(columns=['avg_order_value'])

In [15]:
y= shopify_data_group['avg_order_value']

In [16]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test= train_test_split(x, y, test_size=0.2) 

from sklearn.linear_model import LinearRegression

linear_model= LinearRegression()

linear_model.fit(x_train, y_train)

predicted_values = linear_model.predict(x_test)

In [17]:
from sklearn.metrics import mean_absolute_error
MAE=mean_absolute_error(y_test, predicted_values)
round(MAE,3)

32.424